src/Конфигурация/DataProcessors/ЗаполнениеГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеГрафика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Конфигурация/InformationRegisters/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Конфигурация/DataProcessors/ЗаполнениеГрафика/Ext/ObjectModule.bsl
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, График) Экспорт 

	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.График.Установить(График);
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	             
	Дат = ДатаНачала;
	РазностьДней = (НачалоДня(ДатаНачала) - НачалоДня(График.НачалоГрафика))/ЧислоСекундВСутках;
	
	// Массив с часами графика
	Часы = График.РабочиеЧасы.ВыгрузитьКолонку("Часы");
	ПериодГрафика = Часы.Количество();
	// Начальное смещение по графику
	Смещ =  ?(РазностьДней < 0, ПериодГрафика, 0) + (РазностьДней % ПериодГрафика);
	
	Для Индекс = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[Индекс];
		Если Запись.Дата < ДатаНачала Тогда
		    Продолжить;
		ИначеЕсли Запись.Дата = Дат Тогда
			Запись.График	    = График;
			Запись.ЗначениеЧасы = Часы[Смещ];
			Запись.ЗначениеДни  = ?(Часы[Смещ] = 0, 0, 1);
			Дат  = Дат + ЧислоСекундВСутках;
			Смещ = (Смещ + 1) % ПериодГрафика;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Дата		 = Дат;
				НоваяЗапись.График 		 = График;
				НоваяЗапись.ЗначениеЧасы = Часы[Смещ];
				НоваяЗапись.ЗначениеДни  = ?(Часы[Смещ] = 0, 0, 1);
				Дат  = Дат + ЧислоСекундВСутках;
				Смещ = (Смещ + 1) % ПериодГрафика;
			КонецЦикла; 
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Запись.График 		= График;
				Запись.ЗначениеЧасы = Часы[Смещ];
				Запись.ЗначениеДни 	= ?(Часы[Смещ] = 0, 0, 1);
			КонецЕсли;
			Дат  = Дат + ЧислоСекундВСутках;
			Смещ = (Смещ + 1) % ПериодГрафика;
		КонецЕсли;
	КонецЦикла;
	Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.Дата 		= Дат;
		Запись.График 		= График;
		Запись.ЗначениеЧасы = Часы[Смещ];
		Запись.ЗначениеДни 	= ?(Часы[Смещ] = 0, 0, 1);

		Дат  = Дат + ЧислоСекундВСутках;
		Смещ = (Смещ + 1) % ПериодГрафика;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры
